views/pos-order/index.php

SELECT * FROM `pos_order`
---
                ]);
        ?>

        <?= Html::dropDownList('odate', $searchModel->order_date, ArrayHelper::map(PosOrder::find()->all(), 'order_date','order_date'),[
            'class'=>'form-control'
        ]) ?>