views/pos-order/posreport.php

                ]);
        ?>

        <?= Html::dropDownList('odate', $searchModel->order_date, ArrayHelper::map(PosOrder::find()->all(), 'order_date','order_date'),[
            'class'=>'form-control'
        ]) ?>
---
SELECT * FROM `pos_order`