controllers/PosOrderController.php

        $request = Yii::$app->request->post();
        if($request){
            for ($i=0; $i < count($models) ; $i++) {
                $pos = PosReport::find()->where([
                        'item_id'=>$models[$i]['id'],
                        'date'=>$models[$i]['order_date']
                    ])->one();
---
SELECT * FROM `pos_report` WHERE (`item_id`='13') AND (`date`='2016-01-25')